--
-- Dumping data for table `categories`
--

LOCK TABLES `categories` WRITE;
/*!40000 ALTER TABLE `categories` DISABLE KEYS */;
INSERT INTO `categories` VALUES 
(6,'디저트'),
(4,'양식'),
(2,'일식'),
(3,'중식'),
(5,'카페'),
(1,'한식');
/*!40000 ALTER TABLE `categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `contact_us`
--

LOCK TABLES `contact_us` WRITE;
/*!40000 ALTER TABLE `contact_us` DISABLE KEYS */;
INSERT INTO `contact_us` VALUES 
(1,19,'안녕하세요','맛집','추가','2024-10-16 02:22:47','2024-10-18 00:03:32',0,16),
(3,4,'맛집','맛집맛집','맛집맛집','2024-10-17 06:59:17','2024-10-17 08:21:05',0,2),
(4,4,'장현수','장현수네 가게','장현수맛집','2024-10-17 08:06:18','2024-10-17 08:36:23',0,10),
(5,2,'제목입니다','테스트입니다','추가','2024-10-18 00:08:09','2024-10-18 00:08:09',0,0),
(6,3,'맛집추천입니다','홍통반점','맛집맛집','2024-10-18 00:08:09','2024-10-18 00:08:09',0,0),
(7,4,'맛집추천입니다','장현수네 가게','장현수맛집','2024-10-18 00:08:09','2024-10-18 00:08:09',0,0),
(8,2,'제목입니다','테스트입니다','추가','2024-10-18 00:08:12','2024-10-18 00:08:12',0,0),
(9,3,'맛집추천입니다','홍통반점','맛집맛집','2024-10-18 00:08:12','2024-10-18 00:08:12',0,0),
(10,4,'맛집추천입니다','장현수네 가게','장현수맛집','2024-10-18 00:08:12','2024-10-18 00:08:12',0,0),
(11,2,'제목입니다','테스트입니다','추가','2024-10-18 00:08:13','2024-10-18 00:08:13',0,0),
(12,3,'맛집추천입니다','홍통반점','맛집맛집','2024-10-18 00:08:13','2024-10-18 00:55:47',0,46),
(13,4,'맛집추천입니다','장현수네 가게','장현수맛집','2024-10-18 00:08:13','2024-10-18 00:08:13',0,0),
(14,2,'제목입니다','테스트입니다','추가','2024-10-18 00:08:14','2024-10-18 00:08:14',0,0),
(15,3,'맛집추천입니다','홍통반점','맛집맛집','2024-10-18 00:08:14','2024-10-18 00:08:14',0,0),
(16,4,'맛집추천입니다','장현수네 가게','장현수맛집','2024-10-18 00:08:14','2024-10-18 00:08:14',0,0),
(17,2,'제목입니다','테스트입니다','추가','2024-10-18 00:08:14','2024-10-18 00:08:14',0,0),
(18,3,'맛집추천입니다','홍통반점','맛집맛집','2024-10-18 00:08:14','2024-10-18 00:08:14',0,0),
(19,4,'맛집추천입니다','장현수네 가게','장현수맛집','2024-10-18 00:08:14','2024-10-18 00:08:14',0,0),
(20,2,'제목입니다','테스트입니다','추가','2024-10-18 00:08:15','2024-10-18 00:08:15',0,0),
(21,3,'맛집추천입니다','홍통반점','맛집맛집','2024-10-18 00:08:15','2024-10-18 00:08:15',0,0),
(22,4,'맛집추천입니다','장현수네 가게','장현수맛집','2024-10-18 00:08:15','2024-10-18 07:53:35',0,1),
(23,4,'맛집 추천','고기천국','맛있던대요 반영해줘요','2024-10-18 01:00:45','2024-10-18 07:53:23',0,1);
/*!40000 ALTER TABLE `contact_us` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `members`
--

LOCK TABLES `members` WRITE;
/*!40000 ALTER TABLE `members` DISABLE KEYS */;
INSERT INTO `members` VALUES 
(1,'관리자','admin@taste_police.com','admin','1234',2,'010-0000-0000','2024-10-10 23:24:52'),
(2,'김슬기','slg@naver.com','슬기','1234',2,'010-1111-1111','2024-10-10 23:24:52'),
(3,'장현구','hys@gmail.com','현구','12345',1,'010-2121-2121','2024-10-10 23:24:52'),
(4,'정지용','jy@gmail.com','지용','1234',2,'010-3333-3333','2024-10-10 23:24:52'),
(5,'한규현','gh@naver.com','규현','1234',3,'010-4444-4444','2024-10-10 23:24:52'),
(6,'홍길동','hong123@naver.com','동서남북','1234',3,NULL,'2024-10-14 11:17:31'),
(7,'한규현','khh5345@naver.com','kyudori','$2a$10$0rwLp9Z1vZHfSYwv4Y3mfOtoQG0AU3iNuuIVKPSBJ44NOm.G1Dvw2',1,'010-3513-5345','2024-10-14 13:52:23'),
(8,'한규현','d@d.com','d','$2a$10$8wP.Wut/hglmewiwjEWP5OtgJCYJ4iQNsTS10/ZXYUaFrJaeX3KBi',1,'d','2024-10-14 13:53:37'),
(9,'한규현','abcd@naver.com','hkh5345','$2a$10$oHQHtguC9WLOMbCZ1UCXMukBy/nwSFNRHczpPSS1wl.KpRPFETgWC',1,'010-3513-5345','2024-10-14 14:09:51'),
(10,'한규현','234@1d.com','ss','$2a$10$.WEUpvdqyCrO3cwUkoFBJOwOatatDxKwmoDr1QSdRCtz/gJrb3KVW',1,'112','2024-10-14 14:11:56'),
(11,'한규현','hkh5345@gmail.com','hkh5345s','$2a$10$siCRUb0ENLNslMmzm/Q5SuqvM5tnhhJpp0dMpTg/VCHr77sunL4yi',1,'010-3513-5345','2024-10-14 14:15:37'),
(12,'말미잘','babo@babo.com','HAPPY','$2a$10$evOY5zGCQ5O4Z/5dQda.LOc72wkGmBJ4DB7ZjhbZea9Q1lzm7GWZe',1,'112-112','2024-10-14 14:30:56'),
(13,'한규현','1234@1234.com','규현규현','$2a$10$Lk4RQObFK6FE6m7w4.Krk.7eUpRfm8IdKRHEtxeC7YilcmN2Ht7we',1,'010-3513-5345','2024-10-14 23:27:56'),
(14,'루피','dododo@naver.com','먹보대장','1234',1,NULL,'2024-10-15 00:19:35'),
(15,'우솝','yoyoyoyo@naver.com','거짓말쟁이','1234',1,NULL,'2024-10-15 00:23:22'),
(16,'한규현','yoyoyoyo@naver.co','거짓말쟁','$2a$10$LsG69LcfLnJBJqxA6ZdTxuLGaXDwkjaYSa1C0J4S7qvpyf7SvPmDG',1,'123','2024-10-15 00:26:58'),
(17,'한규현','1234@1234.co','Hello','1234',1,'010-3513-5345','2024-10-15 02:57:00'),
(18,'한규현','yoyoyoyo@naver.c','천재','1234',1,'0101-2-2-2-','2024-10-15 03:01:17'),
(19,'한규현','test@test.com','ff2235654','1234',1,'11253','2024-10-15 04:56:32'),
(20,'장현수','kh53@kh53','현수장','1234',1,'123','2024-10-15 07:56:45'),
(21,'한규현','hh@hh.com','HAPPY1','1234',1,'1234','2024-10-15 09:08:13'),
(22,'한규현','123@123.com','123','1234',1,'123','2024-10-15 13:01:01'),
(23,'한규현','hh@hh.coms','천재s','1122',1,'112','2024-10-15 13:31:33');
/*!40000 ALTER TABLE `members` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `menus`
--

LOCK TABLES `menus` WRITE;
/*!40000 ALTER TABLE `menus` DISABLE KEYS */;
INSERT INTO `menus` VALUES 
(1,1,'국밥',8000,'path/to/menu_photo1.jpg'),
(2,1,'수육',12000,'path/to/menu_photo2.jpg'),
(3,2,'비빔밥',9000,'path/to/menu_photo3.jpg'),
(4,2,'불고기',10000,'path/to/menu_photo4.jpg'),
(5,3,'후라이드 치킨',15000,'path/to/menu_photo5.jpg'),
(6,3,'양념 치킨',16000,'path/to/menu_photo6.jpg'),
(8,17,'무한리필',19990,'/uploads/menus/89c3afd7-8d28-4c65-86de-42b700405de3.jpg'),
(9,17,'사이다',1500,'/uploads/menus/ce798973-de4a-48fc-a5b6-fa90326b9f32.jpeg'),
(10,18,'과자',10000,'/uploads/menus/7ee18ac0-9c0a-4e91-b357-99efafbcc778.png'),
(11,18,'밥',200000,'/uploads/menus/f8d19abe-fbd9-49b1-af6a-f783c1d408e3.jpg'),
(12,19,'고기',19000,'/uploads/menus/c837fae3-1935-4bfd-a9c3-8217f686c05e.jpeg');
/*!40000 ALTER TABLE `menus` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `review_replies`
--

LOCK TABLES `review_replies` WRITE;
/*!40000 ALTER TABLE `review_replies` DISABLE KEYS */;
INSERT INTO `review_replies` VALUES 
(19,46,4,'ㅎㅎㅎㅎㅓㅓㅓㅓㅓㅓㅓㅓㅓ','2024-10-18 06:11:38','2024-10-18 06:13:06',0),
(21,51,4,'ㅏㅏㅏㅏㅏㅏㅏㅏㅏㅏ,ㅎㅎㅎㅎㅓㅓㅓㅓㅓㅓㅓㅓㅓ','2024-10-18 06:26:20','2024-10-18 06:26:20',0);
/*!40000 ALTER TABLE `review_replies` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reviews`
--

LOCK TABLES `reviews` WRITE;
/*!40000 ALTER TABLE `reviews` DISABLE KEYS */;
INSERT INTO `reviews` VALUES 
(18,2,6,'생각보다 별로였음 ㅜ',3,'2024-10-17 05:40:02','2024-10-17 05:40:02',0),
(42,1,6,'3333333333333333333jjjjjjjjjjjjjjjjjjjj',5,'2024-10-18 02:40:38','2024-10-18 02:41:45',0),
(43,1,6,'sssssssssssssss',4,'2024-10-18 02:40:46','2024-10-18 02:40:46',0),
(45,18,6,'fffffffffff',5,'2024-10-18 02:50:31','2024-10-18 02:50:31',0),
(46,6,6,'ffffffffffffffffff',5,'2024-10-18 02:56:46','2024-10-18 02:56:46',0),
(49,17,6,'사이다가 제일 맛있었음!',3,'2024-10-18 06:04:52','2024-10-18 06:04:52',0),
(51,6,4,'ㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎ',1,'2024-10-18 06:12:31','2024-10-18 06:12:31',0);
/*!40000 ALTER TABLE `reviews` ENABLE KEYS */;
UNLOCK TABLES;
